# *****************************************************************************************
# Design - манипуляции (действия) с объектами kivy
class Design:
    # ---------------------------------------------------------------------------
    # отключение кнопки (объект Button) при нажатии
    def button_disable(self, buttton):
        buttton.disabled = True
    # ---------------------------------------------------------------------------
    # включение кнопки (объект Button) при нажатии
    def button_enable(self, buttton):
        buttton.disabled = False
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# тесты
# если не модуль то выполнить программу
if __name__ == '__main__':
    pass
# *****************************************************************************************